Revit 2027 API
AnalysisDisplayDeformedShapeSettings.GridLineWeight Property
 Line weight of grid lines.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GridLineWeight { get; set; }
Public Property GridLineWeight As Integer
	Get
	Set
public:
property int GridLineWeight {
	int get ();
	void set (int value);
}
member GridLineWeight : int with get, set
Property Value
Int32
See Also
Reference
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace